Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxLmu_bf.h
/** \\brief  Length for Ifx_LMU_MODID_Bits.ID_VALUE */
#define IFX_LMU_MODID_ID_VALUE_LEN   (32)

/** \\brief  Mask for Ifx_LMU_MODID_Bits.ID_VALUE */
#define IFX_LMU_MODID_ID_VALUE_MSK   (0xffffffff)

/** \\brief  Offset for Ifx_LMU_MODID_Bits.ID_VALUE */
#define IFX_LMU_MODID_ID_VALUE_OFF   (0)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENWA_EN0_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENWA_EN0_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN0 */
#define IFX_LMU_RGN_ACCENWA_EN0_OFF  (0)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN10 */
#define IFX_LMU_RGN_ACCENWA_EN10_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN10 */
#define IFX_LMU_RGN_ACCENWA_EN10_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN10 */
#define IFX_LMU_RGN_ACCENWA_EN10_OFF (10)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN11 */
#define IFX_LMU_RGN_ACCENWA_EN11_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN11 */
#define IFX_LMU_RGN_ACCENWA_EN11_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN11 */
#define IFX_LMU_RGN_ACCENWA_EN11_OFF (11)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN12 */
#define IFX_LMU_RGN_ACCENWA_EN12_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN12 */
#define IFX_LMU_RGN_ACCENWA_EN12_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN12 */
#define IFX_LMU_RGN_ACCENWA_EN12_OFF (12)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN13 */
#define IFX_LMU_RGN_ACCENWA_EN13_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN13 */
#define IFX_LMU_RGN_ACCENWA_EN13_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN13 */
#define IFX_LMU_RGN_ACCENWA_EN13_OFF (13)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN14 */
#define IFX_LMU_RGN_ACCENWA_EN14_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN14 */
#define IFX_LMU_RGN_ACCENWA_EN14_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN14 */
#define IFX_LMU_RGN_ACCENWA_EN14_OFF (14)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN15 */
#define IFX_LMU_RGN_ACCENWA_EN15_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN15 */
#define IFX_LMU_RGN_ACCENWA_EN15_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN15 */
#define IFX_LMU_RGN_ACCENWA_EN15_OFF (15)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN16 */
#define IFX_LMU_RGN_ACCENWA_EN16_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN16 */
#define IFX_LMU_RGN_ACCENWA_EN16_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN16 */
#define IFX_LMU_RGN_ACCENWA_EN16_OFF (16)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN17 */
#define IFX_LMU_RGN_ACCENWA_EN17_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN17 */
#define IFX_LMU_RGN_ACCENWA_EN17_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN17 */
#define IFX_LMU_RGN_ACCENWA_EN17_OFF (17)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN18 */
#define IFX_LMU_RGN_ACCENWA_EN18_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN18 */
#define IFX_LMU_RGN_ACCENWA_EN18_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN18 */
#define IFX_LMU_RGN_ACCENWA_EN18_OFF (18)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN19 */
#define IFX_LMU_RGN_ACCENWA_EN19_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN19 */
#define IFX_LMU_RGN_ACCENWA_EN19_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN19 */
#define IFX_LMU_RGN_ACCENWA_EN19_OFF (19)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENWA_EN1_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENWA_EN1_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN1 */
#define IFX_LMU_RGN_ACCENWA_EN1_OFF  (1)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN20 */
#define IFX_LMU_RGN_ACCENWA_EN20_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN20 */
#define IFX_LMU_RGN_ACCENWA_EN20_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN20 */
#define IFX_LMU_RGN_ACCENWA_EN20_OFF (20)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN21 */
#define IFX_LMU_RGN_ACCENWA_EN21_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN21 */
#define IFX_LMU_RGN_ACCENWA_EN21_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN21 */
#define IFX_LMU_RGN_ACCENWA_EN21_OFF (21)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN22 */
#define IFX_LMU_RGN_ACCENWA_EN22_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN22 */
#define IFX_LMU_RGN_ACCENWA_EN22_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN22 */
#define IFX_LMU_RGN_ACCENWA_EN22_OFF (22)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN23 */
#define IFX_LMU_RGN_ACCENWA_EN23_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN23 */
#define IFX_LMU_RGN_ACCENWA_EN23_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN23 */
#define IFX_LMU_RGN_ACCENWA_EN23_OFF (23)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN24 */
#define IFX_LMU_RGN_ACCENWA_EN24_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN24 */
#define IFX_LMU_RGN_ACCENWA_EN24_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN24 */
#define IFX_LMU_RGN_ACCENWA_EN24_OFF (24)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN25 */
#define IFX_LMU_RGN_ACCENWA_EN25_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN25 */
#define IFX_LMU_RGN_ACCENWA_EN25_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN25 */
#define IFX_LMU_RGN_ACCENWA_EN25_OFF (25)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN26 */
#define IFX_LMU_RGN_ACCENWA_EN26_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN26 */
#define IFX_LMU_RGN_ACCENWA_EN26_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN26 */
#define IFX_LMU_RGN_ACCENWA_EN26_OFF (26)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN27 */
#define IFX_LMU_RGN_ACCENWA_EN27_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN27 */
#define IFX_LMU_RGN_ACCENWA_EN27_MSK (0x1)

