Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxLmu_bf.h
/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN27 */
#define IFX_LMU_RGN_ACCENWA_EN27_OFF (27)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN28 */
#define IFX_LMU_RGN_ACCENWA_EN28_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN28 */
#define IFX_LMU_RGN_ACCENWA_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN28 */
#define IFX_LMU_RGN_ACCENWA_EN28_OFF (28)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN29 */
#define IFX_LMU_RGN_ACCENWA_EN29_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN29 */
#define IFX_LMU_RGN_ACCENWA_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN29 */
#define IFX_LMU_RGN_ACCENWA_EN29_OFF (29)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN2 */
#define IFX_LMU_RGN_ACCENWA_EN2_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN2 */
#define IFX_LMU_RGN_ACCENWA_EN2_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN2 */
#define IFX_LMU_RGN_ACCENWA_EN2_OFF  (2)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN30 */
#define IFX_LMU_RGN_ACCENWA_EN30_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN30 */
#define IFX_LMU_RGN_ACCENWA_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN30 */
#define IFX_LMU_RGN_ACCENWA_EN30_OFF (30)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN31 */
#define IFX_LMU_RGN_ACCENWA_EN31_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN31 */
#define IFX_LMU_RGN_ACCENWA_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN31 */
#define IFX_LMU_RGN_ACCENWA_EN31_OFF (31)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN3 */
#define IFX_LMU_RGN_ACCENWA_EN3_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN3 */
#define IFX_LMU_RGN_ACCENWA_EN3_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN3 */
#define IFX_LMU_RGN_ACCENWA_EN3_OFF  (3)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN4 */
#define IFX_LMU_RGN_ACCENWA_EN4_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN4 */
#define IFX_LMU_RGN_ACCENWA_EN4_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN4 */
#define IFX_LMU_RGN_ACCENWA_EN4_OFF  (4)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN5 */
#define IFX_LMU_RGN_ACCENWA_EN5_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN5 */
#define IFX_LMU_RGN_ACCENWA_EN5_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN5 */
#define IFX_LMU_RGN_ACCENWA_EN5_OFF  (5)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN6 */
#define IFX_LMU_RGN_ACCENWA_EN6_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN6 */
#define IFX_LMU_RGN_ACCENWA_EN6_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN6 */
#define IFX_LMU_RGN_ACCENWA_EN6_OFF  (6)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN7 */
#define IFX_LMU_RGN_ACCENWA_EN7_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN7 */
#define IFX_LMU_RGN_ACCENWA_EN7_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN7 */
#define IFX_LMU_RGN_ACCENWA_EN7_OFF  (7)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN8 */
#define IFX_LMU_RGN_ACCENWA_EN8_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN8 */
#define IFX_LMU_RGN_ACCENWA_EN8_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN8 */
#define IFX_LMU_RGN_ACCENWA_EN8_OFF  (8)

/** \\brief  Length for Ifx_LMU_RGN_ACCENWA_Bits.EN9 */
#define IFX_LMU_RGN_ACCENWA_EN9_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGN_ACCENWA_Bits.EN9 */
#define IFX_LMU_RGN_ACCENWA_EN9_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGN_ACCENWA_Bits.EN9 */
#define IFX_LMU_RGN_ACCENWA_EN9_OFF  (9)

/** \\brief  Length for Ifx_LMU_RGN_LA_Bits.ADDR */
#define IFX_LMU_RGN_LA_ADDR_LEN      (23)

/** \\brief  Mask for Ifx_LMU_RGN_LA_Bits.ADDR */
#define IFX_LMU_RGN_LA_ADDR_MSK      (0x7fffff)

/** \\brief  Offset for Ifx_LMU_RGN_LA_Bits.ADDR */
#define IFX_LMU_RGN_LA_ADDR_OFF      (5)

/** \\brief  Length for Ifx_LMU_RGN_UA_Bits.ADDR */
#define IFX_LMU_RGN_UA_ADDR_LEN      (24)

/** \\brief  Mask for Ifx_LMU_RGN_UA_Bits.ADDR */
#define IFX_LMU_RGN_UA_ADDR_MSK      (0xffffff)

/** \\brief  Offset for Ifx_LMU_RGN_UA_Bits.ADDR */
#define IFX_LMU_RGN_UA_ADDR_OFF      (5)

/** \\brief  Length for Ifx_LMU_RGNACCENRA0_Bits.EN0 */
#define IFX_LMU_RGNACCENRA0_EN0_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA0_Bits.EN0 */
#define IFX_LMU_RGNACCENRA0_EN0_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA0_Bits.EN0 */
#define IFX_LMU_RGNACCENRA0_EN0_OFF  (0)

/** \\brief  Length for Ifx_LMU_RGNACCENRA0_Bits.EN10 */
#define IFX_LMU_RGNACCENRA0_EN10_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA0_Bits.EN10 */
#define IFX_LMU_RGNACCENRA0_EN10_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA0_Bits.EN10 */
#define IFX_LMU_RGNACCENRA0_EN10_OFF (10)

/** \\brief  Length for Ifx_LMU_RGNACCENRA0_Bits.EN11 */
#define IFX_LMU_RGNACCENRA0_EN11_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA0_Bits.EN11 */
#define IFX_LMU_RGNACCENRA0_EN11_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA0_Bits.EN11 */
#define IFX_LMU_RGNACCENRA0_EN11_OFF (11)

/** \\brief  Length for Ifx_LMU_RGNACCENRA0_Bits.EN12 */
#define IFX_LMU_RGNACCENRA0_EN12_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA0_Bits.EN12 */
#define IFX_LMU_RGNACCENRA0_EN12_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA0_Bits.EN12 */
#define IFX_LMU_RGNACCENRA0_EN12_OFF (12)

/** \\brief  Length for Ifx_LMU_RGNACCENRA0_Bits.EN13 */
#define IFX_LMU_RGNACCENRA0_EN13_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA0_Bits.EN13 */
#define IFX_LMU_RGNACCENRA0_EN13_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA0_Bits.EN13 */
#define IFX_LMU_RGNACCENRA0_EN13_OFF (13)

/** \\brief  Length for Ifx_LMU_RGNACCENRA0_Bits.EN14 */
#define IFX_LMU_RGNACCENRA0_EN14_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA0_Bits.EN14 */
#define IFX_LMU_RGNACCENRA0_EN14_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA0_Bits.EN14 */
#define IFX_LMU_RGNACCENRA0_EN14_OFF (14)

