Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxLmu_bf.h
/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN14 */
#define IFX_LMU_RGNACCENRA2_EN14_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN14 */
#define IFX_LMU_RGNACCENRA2_EN14_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN14 */
#define IFX_LMU_RGNACCENRA2_EN14_OFF (14)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN15 */
#define IFX_LMU_RGNACCENRA2_EN15_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN15 */
#define IFX_LMU_RGNACCENRA2_EN15_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN15 */
#define IFX_LMU_RGNACCENRA2_EN15_OFF (15)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN16 */
#define IFX_LMU_RGNACCENRA2_EN16_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN16 */
#define IFX_LMU_RGNACCENRA2_EN16_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN16 */
#define IFX_LMU_RGNACCENRA2_EN16_OFF (16)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN17 */
#define IFX_LMU_RGNACCENRA2_EN17_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN17 */
#define IFX_LMU_RGNACCENRA2_EN17_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN17 */
#define IFX_LMU_RGNACCENRA2_EN17_OFF (17)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN18 */
#define IFX_LMU_RGNACCENRA2_EN18_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN18 */
#define IFX_LMU_RGNACCENRA2_EN18_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN18 */
#define IFX_LMU_RGNACCENRA2_EN18_OFF (18)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN19 */
#define IFX_LMU_RGNACCENRA2_EN19_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN19 */
#define IFX_LMU_RGNACCENRA2_EN19_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN19 */
#define IFX_LMU_RGNACCENRA2_EN19_OFF (19)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN1 */
#define IFX_LMU_RGNACCENRA2_EN1_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN1 */
#define IFX_LMU_RGNACCENRA2_EN1_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN1 */
#define IFX_LMU_RGNACCENRA2_EN1_OFF  (1)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN20 */
#define IFX_LMU_RGNACCENRA2_EN20_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN20 */
#define IFX_LMU_RGNACCENRA2_EN20_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN20 */
#define IFX_LMU_RGNACCENRA2_EN20_OFF (20)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN21 */
#define IFX_LMU_RGNACCENRA2_EN21_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN21 */
#define IFX_LMU_RGNACCENRA2_EN21_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN21 */
#define IFX_LMU_RGNACCENRA2_EN21_OFF (21)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN22 */
#define IFX_LMU_RGNACCENRA2_EN22_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN22 */
#define IFX_LMU_RGNACCENRA2_EN22_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN22 */
#define IFX_LMU_RGNACCENRA2_EN22_OFF (22)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN23 */
#define IFX_LMU_RGNACCENRA2_EN23_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN23 */
#define IFX_LMU_RGNACCENRA2_EN23_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN23 */
#define IFX_LMU_RGNACCENRA2_EN23_OFF (23)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN24 */
#define IFX_LMU_RGNACCENRA2_EN24_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN24 */
#define IFX_LMU_RGNACCENRA2_EN24_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN24 */
#define IFX_LMU_RGNACCENRA2_EN24_OFF (24)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN25 */
#define IFX_LMU_RGNACCENRA2_EN25_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN25 */
#define IFX_LMU_RGNACCENRA2_EN25_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN25 */
#define IFX_LMU_RGNACCENRA2_EN25_OFF (25)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN26 */
#define IFX_LMU_RGNACCENRA2_EN26_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN26 */
#define IFX_LMU_RGNACCENRA2_EN26_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN26 */
#define IFX_LMU_RGNACCENRA2_EN26_OFF (26)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN27 */
#define IFX_LMU_RGNACCENRA2_EN27_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN27 */
#define IFX_LMU_RGNACCENRA2_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN27 */
#define IFX_LMU_RGNACCENRA2_EN27_OFF (27)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN28 */
#define IFX_LMU_RGNACCENRA2_EN28_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN28 */
#define IFX_LMU_RGNACCENRA2_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN28 */
#define IFX_LMU_RGNACCENRA2_EN28_OFF (28)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN29 */
#define IFX_LMU_RGNACCENRA2_EN29_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN29 */
#define IFX_LMU_RGNACCENRA2_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN29 */
#define IFX_LMU_RGNACCENRA2_EN29_OFF (29)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN2 */
#define IFX_LMU_RGNACCENRA2_EN2_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN2 */
#define IFX_LMU_RGNACCENRA2_EN2_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN2 */
#define IFX_LMU_RGNACCENRA2_EN2_OFF  (2)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN30 */
#define IFX_LMU_RGNACCENRA2_EN30_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN30 */
#define IFX_LMU_RGNACCENRA2_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN30 */
#define IFX_LMU_RGNACCENRA2_EN30_OFF (30)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN31 */
#define IFX_LMU_RGNACCENRA2_EN31_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN31 */
#define IFX_LMU_RGNACCENRA2_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN31 */
#define IFX_LMU_RGNACCENRA2_EN31_OFF (31)

/** \\brief  Length for Ifx_LMU_RGNACCENRA2_Bits.EN3 */
#define IFX_LMU_RGNACCENRA2_EN3_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA2_Bits.EN3 */
#define IFX_LMU_RGNACCENRA2_EN3_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA2_Bits.EN3 */
#define IFX_LMU_RGNACCENRA2_EN3_OFF  (3)

