Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxLmu_bf.h
/** \\brief  Offset for Ifx_LMU_RGNACCENRA6_Bits.EN30 */
#define IFX_LMU_RGNACCENRA6_EN30_OFF (30)

/** \\brief  Length for Ifx_LMU_RGNACCENRA6_Bits.EN31 */
#define IFX_LMU_RGNACCENRA6_EN31_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA6_Bits.EN31 */
#define IFX_LMU_RGNACCENRA6_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA6_Bits.EN31 */
#define IFX_LMU_RGNACCENRA6_EN31_OFF (31)

/** \\brief  Length for Ifx_LMU_RGNACCENRA6_Bits.EN3 */
#define IFX_LMU_RGNACCENRA6_EN3_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA6_Bits.EN3 */
#define IFX_LMU_RGNACCENRA6_EN3_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA6_Bits.EN3 */
#define IFX_LMU_RGNACCENRA6_EN3_OFF  (3)

/** \\brief  Length for Ifx_LMU_RGNACCENRA6_Bits.EN4 */
#define IFX_LMU_RGNACCENRA6_EN4_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA6_Bits.EN4 */
#define IFX_LMU_RGNACCENRA6_EN4_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA6_Bits.EN4 */
#define IFX_LMU_RGNACCENRA6_EN4_OFF  (4)

/** \\brief  Length for Ifx_LMU_RGNACCENRA6_Bits.EN5 */
#define IFX_LMU_RGNACCENRA6_EN5_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA6_Bits.EN5 */
#define IFX_LMU_RGNACCENRA6_EN5_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA6_Bits.EN5 */
#define IFX_LMU_RGNACCENRA6_EN5_OFF  (5)

/** \\brief  Length for Ifx_LMU_RGNACCENRA6_Bits.EN6 */
#define IFX_LMU_RGNACCENRA6_EN6_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA6_Bits.EN6 */
#define IFX_LMU_RGNACCENRA6_EN6_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA6_Bits.EN6 */
#define IFX_LMU_RGNACCENRA6_EN6_OFF  (6)

/** \\brief  Length for Ifx_LMU_RGNACCENRA6_Bits.EN7 */
#define IFX_LMU_RGNACCENRA6_EN7_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA6_Bits.EN7 */
#define IFX_LMU_RGNACCENRA6_EN7_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA6_Bits.EN7 */
#define IFX_LMU_RGNACCENRA6_EN7_OFF  (7)

/** \\brief  Length for Ifx_LMU_RGNACCENRA6_Bits.EN8 */
#define IFX_LMU_RGNACCENRA6_EN8_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA6_Bits.EN8 */
#define IFX_LMU_RGNACCENRA6_EN8_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA6_Bits.EN8 */
#define IFX_LMU_RGNACCENRA6_EN8_OFF  (8)

/** \\brief  Length for Ifx_LMU_RGNACCENRA6_Bits.EN9 */
#define IFX_LMU_RGNACCENRA6_EN9_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA6_Bits.EN9 */
#define IFX_LMU_RGNACCENRA6_EN9_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA6_Bits.EN9 */
#define IFX_LMU_RGNACCENRA6_EN9_OFF  (9)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN0 */
#define IFX_LMU_RGNACCENRA7_EN0_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN0 */
#define IFX_LMU_RGNACCENRA7_EN0_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN0 */
#define IFX_LMU_RGNACCENRA7_EN0_OFF  (0)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN10 */
#define IFX_LMU_RGNACCENRA7_EN10_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN10 */
#define IFX_LMU_RGNACCENRA7_EN10_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN10 */
#define IFX_LMU_RGNACCENRA7_EN10_OFF (10)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN11 */
#define IFX_LMU_RGNACCENRA7_EN11_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN11 */
#define IFX_LMU_RGNACCENRA7_EN11_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN11 */
#define IFX_LMU_RGNACCENRA7_EN11_OFF (11)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN12 */
#define IFX_LMU_RGNACCENRA7_EN12_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN12 */
#define IFX_LMU_RGNACCENRA7_EN12_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN12 */
#define IFX_LMU_RGNACCENRA7_EN12_OFF (12)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN13 */
#define IFX_LMU_RGNACCENRA7_EN13_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN13 */
#define IFX_LMU_RGNACCENRA7_EN13_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN13 */
#define IFX_LMU_RGNACCENRA7_EN13_OFF (13)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN14 */
#define IFX_LMU_RGNACCENRA7_EN14_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN14 */
#define IFX_LMU_RGNACCENRA7_EN14_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN14 */
#define IFX_LMU_RGNACCENRA7_EN14_OFF (14)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN15 */
#define IFX_LMU_RGNACCENRA7_EN15_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN15 */
#define IFX_LMU_RGNACCENRA7_EN15_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN15 */
#define IFX_LMU_RGNACCENRA7_EN15_OFF (15)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN16 */
#define IFX_LMU_RGNACCENRA7_EN16_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN16 */
#define IFX_LMU_RGNACCENRA7_EN16_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN16 */
#define IFX_LMU_RGNACCENRA7_EN16_OFF (16)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN17 */
#define IFX_LMU_RGNACCENRA7_EN17_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN17 */
#define IFX_LMU_RGNACCENRA7_EN17_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN17 */
#define IFX_LMU_RGNACCENRA7_EN17_OFF (17)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN18 */
#define IFX_LMU_RGNACCENRA7_EN18_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN18 */
#define IFX_LMU_RGNACCENRA7_EN18_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN18 */
#define IFX_LMU_RGNACCENRA7_EN18_OFF (18)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN19 */
#define IFX_LMU_RGNACCENRA7_EN19_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN19 */
#define IFX_LMU_RGNACCENRA7_EN19_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN19 */
#define IFX_LMU_RGNACCENRA7_EN19_OFF (19)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN1 */
#define IFX_LMU_RGNACCENRA7_EN1_LEN  (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN1 */
#define IFX_LMU_RGNACCENRA7_EN1_MSK  (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN1 */
#define IFX_LMU_RGNACCENRA7_EN1_OFF  (1)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN20 */
#define IFX_LMU_RGNACCENRA7_EN20_LEN (1)

/** \\brief  Mask for Ifx_LMU_RGNACCENRA7_Bits.EN20 */
#define IFX_LMU_RGNACCENRA7_EN20_MSK (0x1)

/** \\brief  Offset for Ifx_LMU_RGNACCENRA7_Bits.EN20 */
#define IFX_LMU_RGNACCENRA7_EN20_OFF (20)

/** \\brief  Length for Ifx_LMU_RGNACCENRA7_Bits.EN21 */
#define IFX_LMU_RGNACCENRA7_EN21_LEN (1)

